In [3]:
import pandas as pd

1. Data Analysing
2. Data Cleaning
3. Data Exploring
4. Data manipulating

In [4]:
# pandas series(1-D array/ single row or column)
#data frame(2-D array/ Tables:rows,columns)

In [5]:
a=pd.Series ([])

C:\Users\shiva\AppData\Local\Temp\ipykernel_14424\3101582392.py:1: FutureWarning: The default dtype for empty Series will be 'object' instead of 'float64' in a future version. Specify a dtype explicitly to silence this warning.
  a=pd.Series ([])

In [6]:
a

Series([], dtype: float64)

In [8]:
b=pd.Series([1,2,3,4,5,6])
b

0    1
1    2
2    3
3    4
4    5
5    6
dtype: int64

In [9]:
c=pd.Series([1,2,3,4,5,6,7,8])
c

0    1
1    2
2    3
3    4
4    5
5    6
6    7
7    8
dtype: int64

In [10]:
a.dtype

dtype('float64')

In [11]:
b.dtype

dtype('int64')

In [12]:
c.dtype

dtype('int64')

In [14]:
len(a)

0

In [15]:
len(b)

6

In [16]:
max(c)

8

In [17]:
b.ndim

1

In [18]:
c.ndim

1

In [19]:
b.size

6

In [20]:
a.shape

(0,)

In [21]:
b.shape

(6,)

In [22]:
c.shape

(8,)

In [23]:
#Dictionary
pd.Series({'a':20,'b':10,'c':15})

a    20
b    10
c    15
dtype: int64

In [24]:
import numpy as np
pd.Series(np.array([1,2,3,4,5,6]))

0    1
1    2
2    3
3    4
4    5
5    6
dtype: int32

In [25]:
pd.Series([11,22,[1,2,3,4],33,44])

0              11
1              22
2    [1, 2, 3, 4]
3              33
4              44
dtype: object

In [26]:
b=pd.Series([11,22,33,44,55,66],index=['A','B','C','D','E','F'])
b

A    11
B    22
C    33
D    44
E    55
F    66
dtype: int64

In [27]:
b=pd.Series([11,22,33,44,55,66],index=list('abcdef'))
b

a    11
b    22
c    33
d    44
e    55
f    66
dtype: int64

In [28]:
b=pd.Series([11,22,33,44,55,66])
b

0    11
1    22
2    33
3    44
4    55
5    66
dtype: int64

In [29]:
c=pd.Series([20,25,15,30,35,29,70])
c

0    20
1    25
2    15
3    30
4    35
5    29
6    70
dtype: int64

In [30]:
c[1]

25

In [31]:
c[-1]

KeyError: -1

In [36]:
b

0    11
1    22
2    33
3    44
4    55
5    66
dtype: int64

In [33]:
b[1]

22

In [39]:
b[2:5] #Slicing

2    33
3    44
4    55
dtype: int64

In [41]:
D=pd.DataFrame([1,2,3,4,5,6])
D

   0
0  1
1  2
2  3
3  4
4  5
5  6

In [1]:
import pandas as pd
a=pd.DataFrame([1,11,2,22,3,33,4,44])

In [2]:
a

    0
0   1
1  11
2   2
3  22
4   3
5  33
6   4
7  44

In [9]:
a=pd.DataFrame([[1,5,55],[11,7,77],[2,3,33],[22,9,19],[3,8,18]])

In [10]:
a

    0  1   2
0   1  5  55
1  11  7  77
2   2  3  33
3  22  9  19
4   3  8  18

In [11]:
type(a)

pandas.core.frame.DataFrame

In [15]:
a.dtypes

0    int64
1    int64
2    int64
dtype: object

In [16]:
a.shape

(5, 3)

In [21]:
a.head() 
#first 5 rows

    0  1   2
0   1  5  55
1  11  7  77
2   2  3  33
3  22  9  19
4   3  8  18

In [22]:
a.head(2)
# in bracket it will shows first two

    0  1   2
0   1  5  55
1  11  7  77

In [19]:
a.tail()
# last 5 rows

    0  1   2
0   1  5  55
1  11  7  77
2   2  3  33
3  22  9  19
4   3  8  18

In [20]:
a.sample(2)
# random 2 sample from databs

    0  1   2
3  22  9  19
2   2  3  33

In [2]:
import numpy as np
b=pd.DataFrame([[1,5,np.nan],[11,np.nan,77],[2,3,33],[22,np.nan,19],[3,8,18]])

In [30]:
b

    0    1     2
0   1  5.0   NaN
1  11  NaN  77.0
2   2  3.0  33.0
3  22  NaN  19.0
4   3  8.0  18.0

In [36]:
import numpy as np
b=pd.DataFrame([[1,5,],[11,77,],[2,3,33],[22,19,],[3,8,18]])

In [35]:
b

    0   1     2
0   1   5   NaN
1  11  77   NaN
2   2   3  33.0
3  22  19   NaN
4   3   8  18.0

In [5]:
import pandas as pd
import nump
d=pd.DataFrame({'a':[5,2],'b':[3,7],'c':[8,5]})
#dictionRY

In [6]:
d

   a  b  c
0  5  3  8
1  2  7  5

In [12]:
d=pd.DataFrame({'a':[5,2,'missing'],'b':[3,'missing',7],'c':['missing',8,5]})

In [13]:
d

         a        b        c
0        5        3  missing
1        2  missing        8
2  missing        7        5

In [82]:
a=pd.DataFrame([[11,22,33],[6,5,8],[7,88,99]],columns=['ColA','ColB','ColC'])
a

   ColA  ColB  ColC
0    11    22    33
1     6     5     8
2     7    88    99

In [18]:
a.columns

Index(['ColA', 'ColB', 'ColC'], dtype='object')

In [19]:
a.info

<bound method DataFrame.info of    ColA  ColB  ColC
0    11    22    33
1     6     5     8
2     7    88    99>

In [20]:
a.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   ColA    3 non-null      int64
 1   ColB    3 non-null      int64
 2   ColC    3 non-null      int64
dtypes: int64(3)
memory usage: 140.0 bytes

In [22]:
a.describe()

            ColA       ColB       ColC
count   3.000000   3.000000   3.000000
mean    8.000000  38.333333  46.666667
std     2.645751  43.844422  47.014182
min     6.000000   5.000000   8.000000
25%     6.500000  13.500000  20.500000
50%     7.000000  22.000000  33.000000
75%     9.000000  55.000000  66.000000
max    11.000000  88.000000  99.000000

In [23]:
a['ColA']

0    11
1     6
2     7
Name: ColA, dtype: int64

In [26]:
a['ColB'].max()

88

In [27]:
a['ColC'].min()

8

In [28]:
len(a)

3

In [30]:
a[['ColB','ColC']]

   ColB  ColC
0    22    33
1     5     8
2    88    99

In [32]:
a['ColA']>10

0     True
1    False
2    False
Name: ColA, dtype: bool

In [33]:
    a[a['ColA']>10]

   ColA  ColB  ColC
0    11    22    33

In [34]:
a

   ColA  ColB  ColC
0    11    22    33
1     6     5     8
2     7    88    99

In [35]:
a[a['ColA']>10]['ColA']

0    11
Name: ColA, dtype: int64

In [36]:
#loc
#iloc

In [42]:
# syntax: a.loc[row,'colname']
a.loc[0,'ColA']

11

In [44]:
a.loc[[0,1,2],'ColA']

0    11
1     6
2     7
Name: ColA, dtype: int64

In [45]:
a.loc[[0,1,2],['ColA','ColB']]

   ColA  ColB
0    11    22
1     6     5
2     7    88

In [46]:
a.loc[:2,'ColA']

0    11
1     6
2     7
Name: ColA, dtype: int64

In [47]:
a

   ColA  ColB  ColC
0    11    22    33
1     6     5     8
2     7    88    99

In [48]:
#iloc
a.iloc[0,0]

11

In [49]:
a.iloc[0,1]

22

In [50]:
a.iloc[2,0]

7

In [52]:
a.iloc[[0,1,2],0]

0    11
1     6
2     7
Name: ColA, dtype: int64

In [53]:
a.loc[[1,2],[1,2]]

   ColB  ColC
1     5     8
2    88    99

In [83]:
a

   ColA  ColB  ColC
0    11    22    33
1     6     5     8
2     7    88    99

In [40]:
a=pd.DataFrame([[1,2,3],[4,5,6],[7,8,9],[1,2,3],[4,5,6],[7,8,9],[1,2,3],[4,5,6]],index=list('abcdefgh'),columns=['ColA','ColB','ColC'])

In [28]:
a

   ColA  ColB  ColC
a     1     2     3
b     4     5     6
c     7     8     9
d     1     2     3
e     4     5     6
f     7     8     9
g     1     2     3
h     4     5     6

In [9]:
# to add column
a['age']=[1,2,3,4,5,6,7,8]

In [10]:
a

   ColA  ColB  ColC  age
0     1     2     3    1
1     4     5     6    2
2     7     8     9    3
3     1     2     3    4
4     4     5     6    5
5     7     8     9    6
6     1     2     3    7
7     4     5     6    8

In [11]:
print(a)

   ColA  ColB  ColC  age
0     1     2     3    1
1     4     5     6    2
2     7     8     9    3
3     1     2     3    4
4     4     5     6    5
5     7     8     9    6
6     1     2     3    7
7     4     5     6    8

In [16]:
a['ColD']=a['ColA']+a['ColB']

In [17]:
a

   ColA  ColB  ColC  age  ColD
0     1     2     3    1     3
1     4     5     6    2     9
2     7     8     9    3    15
3     1     2     3    4     3
4     4     5     6    5     9
5     7     8     9    6    15
6     1     2     3    7     3
7     4     5     6    8     9

In [19]:
a.columns

Index(['ColA', 'ColB', 'ColC', 'age', 'ColD'], dtype='object')

In [20]:
#col - axis=1
#row - axis =0
#permanent - inplace=True

#how to delete a column
a.drop('age',axis=1)

   ColA  ColB  ColC  ColD
0     1     2     3     3
1     4     5     6     9
2     7     8     9    15
3     1     2     3     3
4     4     5     6     9
5     7     8     9    15
6     1     2     3     3
7     4     5     6     9

In [21]:
print(a)

   ColA  ColB  ColC  age  ColD
0     1     2     3    1     3
1     4     5     6    2     9
2     7     8     9    3    15
3     1     2     3    4     3
4     4     5     6    5     9
5     7     8     9    6    15
6     1     2     3    7     3
7     4     5     6    8     9

In [23]:
a.drop('age',axis=1,inplace=True)

In [29]:
print(a)

   ColA  ColB  ColC
a     1     2     3
b     4     5     6
c     7     8     9
d     1     2     3
e     4     5     6
f     7     8     9
g     1     2     3
h     4     5     6

In [30]:
a.drop('c',axis=0,inplace=True)

In [31]:
a

   ColA  ColB  ColC
a     1     2     3
b     4     5     6
d     1     2     3
e     4     5     6
f     7     8     9
g     1     2     3
h     4     5     6

In [38]:
a.drop(['ColA','ColC'],axis=1)

   ColB
a     2
b     5
d     2
e     5
f     8
g     2
h     5

In [39]:
a

   ColA  ColB  ColC
a     1     2     3
b     4     5     6
d     1     2     3
e     4     5     6
f     7     8     9
g     1     2     3
h     4     5     6

In [46]:
# to replace a column in index
a.set_index('ColC',inplace=True)

In [47]:
a

      ColA  ColB
ColC
3        1     2
6        4     5
9        7     8
3        1     2
6        4     5
9        7     8
3        1     2
6        4     5

In [48]:
a.columns

Index(['ColA', 'ColB'], dtype='object')

In [52]:
a.reset_index(inplace=True)

In [53]:
a

   ColC  ColA  ColB
0     3     1     2
1     6     4     5
2     9     7     8
3     3     1     2
4     6     4     5
5     9     7     8
6     3     1     2
7     6     4     5